<?php

namespace Larabookir\Gateway\Parsian;


class ParsianResult
{
    public static $errors
        = [
            -32768 => "خطاي ناشناخته رخ داده است",
            -32768 => "خطاي ناشناخته رخ داده است",
            -1552  => "برگشت تراکنش مجاز نمی باشد",
            -1551  => "برگشت تراکنش قب ًلا انجام شده است",
            -138   => "عملیات پرداخت توسط کاربر لغو شد",
	    -127   => "آدرس اینترنتی معتبر نیست",
	    -126   => "کد شناسایی پذیرنده معتبر نیست",
	    -125   => "کد CVV2 صحیح نیست",
	    -124   => "لطفا فیلد رمز اینترنتی را کامل کنید",
	    -123   => "تاریخ انقضای کارت معتبر نیست",
	    -122   => "شماره کارت معتبر نیست",
	    -121   => "رشته وارد شده عددی نیست",
	    -120   => "طول داده ورودی معتبر نیست",
	    -118   => "مقدار ارسال شده عددی نیست",
	    -117   => "طول رشته کمتر از حد مجاز است",
	    -115   => "شناسه پرداخت نامعتبر است",
	    -114   => "شناسه قبض نامعتبر است",
	    -113   => "پارامتر ورودی خالی است",
	    -111   => "مبلغ تراکنش بیش از حد مجاز است",
	    -102   => "تراکنش با موفقیت برگشت داده شد",
	    -101   => "اهراز هویت پذیرنده مقدور نیست",
	    -100   => "پذیرنده غیرفعال است",
	    -1   => "خطای سرور",	    
            0      => 'تراکنش با موفقیت انجام شد.',
            1      => 'خطا در انجام تراکنش',
            2      => 'بین عملیات وقفه افتاده است.',
	    3      => "پذیرنده نامعتبر است",
	    6      => "بروز خطای ناشناخته",	    
            10     => 'شماره کارت نامعتبر است.',
            11     => 'کارت شما منقضی شده است',
            12     => 'تراکنش نامعتبر است',            
            14     => 'شماره کارت نامعتبر است',
            15     => 'صادر کننده کارت نامعتبر است',            
            22     => 'اطلاعات پذیرنده صحیح نیست.',
            30     => 'قالب پیام دارای اشکال است',
            34     => 'تراکنش با موفقیت انجام نپذیرفته است',
	    51     => "موجودی کافی نیست",
	    54     => "تاریخ انقضای کارت سپری شده است",
	    55     => "رمز کارت نامعتبر است",
	    56     => "کارت نامعتبر است",
	    65     => "تعداد درخواست تراکنش بیش از حد مجاز است",
	    69     => "تعداد دفعات تکرار رمز بیش از حد مجاز است",
	    92     => "مقصد تراکنش یافت نشد",
	    93     => "امکان تکمیل تراکنش وجود ندارد",
	    94     => "تراکنش تکراری است",
	    200    => "خطای پیش بینی نشده در سیستم بانکی",
        ];

	public static function errorMessage($errorId)
	{
		return isset(self::$errors[$errorId]) ? self::$errors[$errorId] : $errorId;
	}
}
